load-test.yml
# artillery load test config
config:
  target: 'http://localhost:10010'
  phases:
    # run for 60 seconds
    - duration: 60
      # 20 new visitors per second
      arrivalRate: 20
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/"